    # Pandas for Data Science

    # Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['a','b','c']

In [3]:
my_data=[10,20,30]

In [4]:
arr=np.array(my_data)

In [5]:
arr

array([10, 20, 30])

In [6]:
# Create a series
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
# Create a series- passing numpy array. So either pass a python list or a numpy array
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [8]:
# Create a series using dictionary
d={'a':1,'b':2,'c':3}

In [9]:
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [10]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','USSR', 'Japan'])

In [11]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])

In [12]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [13]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [14]:
ser1['USA']

1

In [15]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

    # Pandas DataFrame

In [16]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [17]:
np.random.seed(101)

In [21]:
df=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [22]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [23]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [24]:
type(df.W)

pandas.core.series.Series

In [ ]:
#to request multiple columns, request list of multiple columns

In [25]:
df[['W','X']]

          W         X
A  0.302665  1.693723
B -0.134841  0.390528
C  0.807706  0.072960
D -0.497104 -0.754070
E -0.116773  1.901755

In [29]:
df['new'] = df['W'] + df['Y']

In [30]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [31]:
df['new2']=df['new']

In [32]:
df

          W         X         Y         Z       new      new2
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354  0.121354

In [37]:
df.drop('new2',axis=1,inplace=True)
#make sure to use axis=1 when dropping columnß 
#inpace =True make sure that delete column  in the same dataframe

In [38]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [39]:
df.drop('E',axis=0,inplace=True)

In [40]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510

In [ ]:
#Selecting rows

In [41]:
df.loc['A']

W      0.302665
X      1.693723
Y     -1.706086
Z     -1.159119
new   -1.403420
Name: A, dtype: float64

In [42]:
df.loc['A':'B']

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064

In [44]:
df.iloc[1:4]

          W         X         Y         Z       new
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510

In [ ]:
# row and column

In [49]:
df.loc['A':'B','W':'Z']

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502

In [50]:
df.loc[['A','B'],['W','Y']]
# pass rows as list
#pass columns as list

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [51]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510

In [58]:
df[df>0]

          W         X         Y         Z       new
A  0.302665  1.693723       NaN       NaN       NaN
B       NaN  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D       NaN       NaN       NaN  0.484752       NaN

In [59]:
df[df['W']>0]

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
C  0.807706  0.072960  0.638787  0.329646  1.446493

In [60]:
df[df['W']>0][['Y','X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [62]:
df[(df['W']>0) &(df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z, new]
Index: []

    # Index and reindexing

In [63]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
1     B -0.134841  0.390528  0.166905  0.184502  0.032064
2     C  0.807706  0.072960  0.638787  0.329646  1.446493
3     D -0.497104 -0.754070 -0.943406  0.484752 -1.440510

In [67]:
state='CO AZ MH MA'.split()

In [68]:
state

['CO', 'AZ', 'MH', 'MA']

In [69]:
df['state']=state

In [70]:
df

          W         X         Y         Z       new state
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420    CO
B -0.134841  0.390528  0.166905  0.184502  0.032064    AZ
C  0.807706  0.072960  0.638787  0.329646  1.446493    MH
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510    MA

In [71]:
df.set_index('state')

              W         X         Y         Z       new
state
CO     0.302665  1.693723 -1.706086 -1.159119 -1.403420
AZ    -0.134841  0.390528  0.166905  0.184502  0.032064
MH     0.807706  0.072960  0.638787  0.329646  1.446493
MA    -0.497104 -0.754070 -0.943406  0.484752 -1.440510

In [72]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [73]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [74]:
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [75]:
df.index.names=['Group','name']

In [76]:
df

                   A         B
Group name
G1    1    -0.993263  0.196800
      2    -1.136645  0.000366
      3     1.025984 -0.156598
G2    1    -0.031579  0.649826
      2     2.154846 -0.610259
      3    -0.755325 -0.346419

In [77]:
df.loc['G1']

             A         B
name
1    -0.993263  0.196800
2    -1.136645  0.000366
3     1.025984 -0.156598

In [79]:
df.xs(['G1',1])

A   -0.993263
B    0.196800
Name: (G1, 1), dtype: float64

In [81]:
df.xs(1,level='name')

              A         B
Group
G1    -0.993263  0.196800
G2    -0.031579  0.649826

In [82]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [83]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [84]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [85]:
df.fillna('Hello')

       A      B  C
0      1      5  1
1      2  Hello  2
2  Hello  Hello  3

In [91]:
df.fillna(method='bfill')

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [92]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [93]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [96]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [99]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [100]:
df.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [101]:
df.groupby('Company').size().value_counts()

2    3
dtype: int64

In [104]:
df.groupby('Company').size()

Company
FB      2
GOOG    2
MSFT    2
dtype: int64

In [107]:
df.describe().transpose()

       count   mean         std    min    25%    50%     75%    max
Sales    6.0  229.5  100.899455  120.0  143.0  221.5  315.75  350.0

In [108]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [109]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [110]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [111]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [112]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [113]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [114]:
pd.concat([df1,df2,df3])
#give df1 df2 and df3 as lists

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [115]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [116]:
pd.merge(left,right,how='inner',on='key')
#pd.merge(left, right, on=['key1', 'key2'])

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

    # Operations

In [117]:

df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [118]:
df['col2'].unique()

array([444, 555, 666])

In [119]:
df['col2'].nunique()

3

In [120]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [123]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [124]:
df['col2'].apply(lambda x:x**2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [125]:
del df['col1']

#df.drop('col1',axis=1,iplace=True)

In [126]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [128]:
# get columns and index
df.columns

Index(['col2', 'col3'], dtype='object')

In [129]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [131]:
df.sort_values('col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [ ]:
#pivot tables

In [132]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

In [134]:

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [135]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [136]:
pwd

'/Users/shashank/Downloads/SpringboardDatascience/DataScience_Bootcamp_Udemy/All_Notebooks/Python-for-Data-Analysis/Pandas'

In [141]:
df = pd.read_csv('example')

In [138]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [146]:
df.to_csv('My_Output',index=False)

In [147]:
pd.read_csv('My_Output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [151]:
#Excel
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [152]:
#HTML
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [153]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","February 17, 2017"
1,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017","February 17, 2017"
2,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
3,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
4,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"

In [159]:
#sql
from sqlalchemy import create_engine

In [160]:
engine = create_engine('sqlite:///:memory:')

In [161]:
df.to_sql('data', engine)

AttributeError: 'list' object has no attribute 'to_sql'

In [164]:

clear

NameError: name 'clear' is not defined